#+title: Lab2
#+PROPERTY: header-args :results drawer

Welcome to Lab2 of *Leveraging Kubernetes for Drupal: A Beginner's Laboratory*
[[org:../repos/labs/DrupalDay2024/lab1.org][Lab1 is a pre-requirement before starting Lab2]]

** Create a namespace for the Drupal deployment:

- What is a namespace?
In Kubernetes, a **namespace** partitions cluster resources for multiple users or teams,
ensuring organization and management. It offers isolation, resource quotas, and access control.
While not a strict security boundary, namespaces help logically separate resources.
They are essential for large environments, allowing efficient, organized, and controlled resource management.

#+begin_src bash
kubectl create namespace drupal
#+end_src

#+RESULTS:
: namespace/drupal created

** Install Drupal

1. Deploy Drupal and MariaDB. This will use the same helm charts from Lab 1 but on a different namespace
#+BEGIN_SRC bash
helm install my-drupal bitnami/drupal -n drupal
#+END_SRC

Yes, you can have multiple sites with the same deployment name in different namespaces!

The previous Drupal site was deployed in the "default" namespace:

#+begin_src bash
kubectl get deployments -A
#+end_src

#+RESULTS:
: NAMESPACE     NAME                     READY   UP-TO-DATE   AVAILABLE   AGE
: default       my-drupal                1/1     1            1           2m26s
: drupal        my-drupal                5/5     5            5           10m
: kube-system   coredns                  1/1     1            1           38m
: kube-system   local-path-provisioner   1/1     1            1           38m
: kube-system   metrics-server           1/1     1            1           38m
: kube-system   traefik                  1/1     1            1           37m



** Verifying the Change

After scaling the deployment, you can verify that the number of replicas has been updated by listing the pods:
#+begin_src sh
kubectl get pods -n drupal -l app.kubernetes.io/name=drupal
#+end_src
#+RESULTS:
: NAME READY STATUS RESTARTS AGE
: my-drupal-7df65485cc-9hxpz 1/1 Running 0 45s
: my-drupal-7df65485cc-ww5p5 1/1 Running 0 14m
This command lists all pods with the label app.kubernetes.io/name=drupal, which should include your my-drupal pods.

You should see 2 pods running if the scaling operation was successful.
Currently there seems to be a bug with the apache container failing with

